#!/bin/bash

#===========================================================================
# Contents   : 部品
#              iniファイルの変数取り込み用
# Author     : da-machi
# LastUpdate : 2019/09/08
# Since      : 2019/09/08
# Problem    : 変数重複を考慮していない
#===========================================================================

#ファイル名(ini)
v_ini_fn=$1/lintset.ini
echo ${v_ini_fn}
#ファイルを変数に取り込む
var="$(<${v_ini_fn})"

#[から始まる行を削除
#\rを削除
#\nを削除
#コメント行を削除
var=`echo "${var}" \
| sed '/^\\[/d' \
| sed '/^\r/d' \
| sed '/^\n/d' \
| sed '/^;/d' \
`

#「:」を「=」に置き換え
var=`echo "${var}" | sed -e 's/:/=/g'`

echo "${var}"


